Tekla Open API Reference for Tekla Structures 2025
StrandUnbondingData Properties
The StrandUnbondingData type exposes the following members.
Properties
Name | Description
FromEnd
 The unbonding from the end of the strand.
FromStart
 The unbonding from the start of the strand.
MiddleToEnd
 The unbonding from the middle of the strand to the end of the strand.
MiddleToStart
 The unbonding from the middle of the strand to the start of the strand.
StrandIndex
 The index of the strand.
Top
See Also
Reference
StrandUnbondingData Class
Tekla.Structures.Model Namespace